In [1]:
import numpy as np
import pandas as pd

# 누락된 데이터 처리

In [2]:
a = np.array([4,2,np.nan,5])

In [4]:
a.dtype

dtype('float64')

In [5]:
type(np.nan)

float

In [6]:
np.sum(a)

nan

In [7]:
np.nansum(a)

11.0

In [10]:
df = pd.DataFrame([[1,2],[3,np.nan]], columns=['x','y'])

In [11]:
df

   x    y
0  1  2.0
1  3  NaN

In [12]:
df.isnull()

       x      y
0  False  False
1  False   True

In [13]:
df.notnull()

      x      y
0  True   True
1  True  False

In [14]:
df.dropna() # NaN이 있는 모든 행을 삭제

   x    y
0  1  2.0

In [15]:
df.dropna(axis=1) # NaN이 있는 모든 열을 삭제

   x
0  1
1  3

In [16]:
df.fillna(0)

   x    y
0  1  2.0
1  3  0.0

# 타이타닉 데이터 분석

In [17]:
titanic = pd.read_csv('titanic.csv')

In [18]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
titanic.describe() # 수치형 칼럼에 대한 요약 통계량

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [22]:
titanic.Survived.unique()

array([0, 1], dtype=int64)

In [24]:
titanic.Name.unique().shape

(891,)

In [25]:
titanic['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [26]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [27]:
titanic.Cabin.isnull().sum()

687

In [30]:
titanic.dropna().shape

(183, 12)

In [31]:
titanic2 = titanic.drop(['Cabin'], axis=1)

In [32]:
titanic2.shape

(891, 11)

In [ ]:
titanic2.info()

In [34]:
titanic3 = titanic2.dropna()

In [35]:
titanic3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Pclass       712 non-null    int64
 3   Name         712 non-null    object
 4   Sex          712 non-null    object
 5   Age          712 non-null    float64
 6   SibSp        712 non-null    int64
 7   Parch        712 non-null    int64
 8   Ticket       712 non-null    object
 9   Fare         712 non-null    float64
 10  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 66.8+ KB

# 데이터 결합

In [38]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})

In [39]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [40]:
df2 = pd.DataFrame({'A':[10,20],'B':[40,55]}, index=[5,9])

In [41]:
df2

    A   B
5  10  40
9  20  55

In [43]:
pd.concat([df1,df2])

    A   B
0   1   4
1   2   5
2   3   6
5  10  40
9  20  55

In [45]:
df3 = pd.DataFrame({'C':[5,2,8], 'D':[10,50,-2]})

In [46]:
df3

   C   D
0  5  10
1  2  50
2  8  -2

In [47]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [48]:
pd.concat([df1,df3],axis=1)

   A  B  C   D
0  1  4  5  10
1  2  5  2  50
2  3  6  8  -2

In [49]:
df4 = df3.loc[0:1,:]

In [50]:
df4

   C   D
0  5  10
1  2  50

In [51]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [55]:
pd.concat([df1,df4], axis=1) #외부조인(합집합) <=> join='outer'

   A  B    C     D
0  1  4  5.0  10.0
1  2  5  2.0  50.0
2  3  6  NaN   NaN

In [56]:
pd.concat([df1,df4], axis=1,join='inner') #내부 조인(교집합)

   A  B  C   D
0  1  4  5  10
1  2  5  2  50

In [57]:
dept = pd.DataFrame({'name':['강','박','이','최'], 'dep':['컴공','컴공','통계','소융']})

In [58]:
dept

  name dep
0    강  컴공
1    박  컴공
2    이  통계
3    최  소융

In [59]:
year = pd.DataFrame({'name':['이','최','강'], 'yr':[2018, 206, 2017]})

In [61]:
year

  name    yr
0    이  2018
1    최   206
2    강  2017

In [63]:
pd.merge(dept,year, on='name') # 내부 조인(교집합)

  name dep    yr
0    강  컴공  2017
1    이  통계  2018
2    최  소융   206

In [64]:
pd.merge(dept,year,how='outer')

  name dep      yr
0    강  컴공  2017.0
1    박  컴공     NaN
2    이  통계  2018.0
3    최  소융   206.0

In [65]:
year2 = pd.DataFrame({'student':['이','최','강'], 'yr':[2018,206,2017]})

In [66]:
pd.merge(dept, year2, left_on='name', right_on='student')

  name dep student    yr
0    강  컴공       강  2017
1    이  통계       이  2018
2    최  소융       최   206

In [67]:
pd.merge(dept, year2, left_on='name', right_on='student').drop('student',axis=1)

  name dep    yr
0    강  컴공  2017
1    이  통계  2018
2    최  소융   206